# SetDropShadowByCls

```pascal
PROCEDURE SetDropShadowByCls(
				h            : HANDLE;
				byClassValue : BOOLEAN);
```

```python
def vs.SetDropShadowByCls(h, byClassValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|byClassValue|BOOLEAN|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Attributes